app/controllers/preferences_controller.rb

SELECT "preferences".* FROM "preferences"
---
    def index
        preferences = Preference.all