app/controllers/quotes_controller.rb

SELECT "preferences".* FROM "preferences" INNER JOIN "user_quote_preferences" ON "preferences"."id" = "user_quote_preferences"."preference_id" WHERE "user_quote_preferences"."user_id" = $1  [["user_id", 1]]
SELECT "quotes".* FROM "quotes" WHERE "quotes"."preference_id" = $1  [["preference_id", 2]]
---
    def random
        preference = current_user.preferences.sample

        if preference
            quote = Quote.where(preference_id: preference.id).sample