app/controllers/weights_controller.rb

    def create
        givenDay = Date.parse(params[:date]) + 12.hour
        if givenDay && givenDay < Time.now.end_of_day
            weight = Weight.find_by(user_id: current_user.id, created_at: givenDay.beginning_of_day..givenDay.end_of_day)
---
SELECT "weights".* FROM "weights" WHERE "weights"."user_id" = $1  [["user_id", 7]]