app/controllers/weights_controller.rb

SELECT  "weights".* FROM "weights" WHERE "weights"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "weights" SET "weight" = $1, "updated_at" = $2 WHERE "weights"."id" = $3  [["weight", 160.0], ["updated_at", "2019-10-14 22:07:45.761876"], ["id", 2]]
---
    def update
        weight = Weight.find_by(id: params[:id])
        if weight
            if weight.user_id == current_user.id
                weight.weight = params[:weight]
                if weight.save

SELECT  "weights".* FROM "weights" WHERE "weights"."user_id" = $1 ORDER BY "weights"."id" DESC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
INSERT INTO "weights" ("user_id", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["weight", 165.0], ["created_at", "2019-10-14 21:04:03.791898"], ["updated_at", "2019-10-14 21:04:03.791898"]]
---
    def create
        if current_user.weights.last

            if current_user.weights.last.created_at < Time.now.beginning_of_day

SELECT  "weights".* FROM "weights" WHERE "weights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "weights" WHERE "weights"."id" = $1  [["id", 1]]
---
    def destroy
        weight = Weight.find_by(id: params[:id])

        if weight
            if weight.user_id == current_user.id
                weight.destroy